# Используем официальный образ Node.js версии 16
FROM node:16

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем исходный код приложения
COPY . .

# Определяем переменную окружения для порта, на котором будет работать приложение
ENV PORT=3000

# Открываем порт контейнера для внешнего доступа
EXPOSE $PORT

# Команда для запуска приложения
CMD ["npm", "start"]
